Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
            <instance name="ICAP6">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP7">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
               </parameters>
            </instance>
            <instance name="ICAP8">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
               </parameters>
            </instance>
            <instance name="ICAP9">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
               </parameters>
            </instance>
            <instance name="ICAP10">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 9"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 8"/>
               </parameters>
            </instance>
            <instance name="ICAP11">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 9"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 8"/>
               </parameters>
            </instance>
            <instance name="ICAP12">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 9"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 8"/>
               </parameters>
            </instance>
            <instance name="ICAP13">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP14">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP15">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP16">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
         </module>
         <module id="02907" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph_pb1_fast" name="INT" name-in-module="INT" offset="0x1f810000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02869" name="JTAG" version="">
            <instance name="JTAG">
               <register-group address-space="periph_pb1_std" name="JTAG" name-in-module="JTAG" offset="0x1f801000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02819" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph_pb1_std" name="NVM" name-in-module="NVM" offset="0x1f800a00" />
               <parameters>
                 <param name="PAGE_SIZE" value="4096"/>
                 <param name="ROW_SIZE" value="512"/>
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph_pb2_std" name="OCMP" name-in-module="OCMP" offset="0x1f820000" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                  <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
                  <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
               </parameters>
            </instance>
