Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="ADC Output Data Register" name="ADCDATA16" offset="0x700" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA17" offset="0x710" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA18" offset="0x720" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA19" offset="0x730" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA20" offset="0x740" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA21" offset="0x750" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA24" offset="0x780" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA25" offset="0x790" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA26" offset="0x7A0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA27" offset="0x7B0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA33" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA34" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA45" offset="0x8D0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA46" offset="0x8E0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA48" offset="0x900" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA49" offset="0x910" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA50" offset="0x920" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA51" offset="0x890" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA52" offset="0x940" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC Output Data Register" name="ADCDATA53" offset="0x950" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
      </register-group>
      <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
         <value caption="Allocates 128 locations in system memory to each analog input" name="" value="0x7" />
         <value caption="Allocates 64 locations in system memory to each analog input" name="" value="0x6" />
         <value caption="Allocates 32 locations in system memory to each analog input" name="" value="0x5" />
         <value caption="Allocates 16 locations in system memory to each analog input" name="" value="0x4" />
         <value caption="Allocates 8 locations in system memory to each analog input" name="" value="0x3" />
         <value caption="Allocates 4 locations in system memory to each analog input" name="" value="0x2" />
         <value caption="Allocates 2 locations in system memory to each analog input" name="" value="0x1" />
         <value caption="Allocates 1 location in system memory to each analog input" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" name="" value="0x1" />
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
         <value caption="Shift x left 7 bit position" name="" value="0x7" />
         <value caption="Shift x left 6 bit position" name="" value="0x6" />
         <value caption="Shift x left 5 bit position" name="" value="0x5" />
         <value caption="Shift x left 4 bit position" name="" value="0x4" />
         <value caption="Shift x left 3 bit position" name="" value="0x3" />
         <value caption="Shift x left 2 bit position" name="" value="0x2" />
         <value caption="Shift x left 1 bit position" name="" value="0x1" />
         <value caption="Shift x left 0 bit position" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast Synchronous Peripheral Clock to ADC Control Clock bit" name="ADCCON1__FSPBCLKEN">
         <value caption="Fast synchronous peripheral clock to ADC control clock is enabled" name="" value="0x1" />
         <value caption="Fast synchronous peripheral clock to ADC control clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast Synchronous System Clock to ADC Control Clock bit" name="ADCCON1__FSSCLKEN">
         <value caption="Fast synchronous system clock to ADC control clock is enabled" name="" value="0x1" />
         <value caption="Fast synchronous system clock to ADC control clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Capacitive Voltage Division Enable bit" name="ADCCON1__CVDEN">
         <value caption="CVD operation is enabled" name="" value="0x1" />
         <value caption="CVD operation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Charge Pump Enable bit" name="ADCCON1__AICPMPEN">
         <value caption="Analog input charge pump is enabled" name="" value="0x1" />
         <value caption="Analog input charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="ADCCON1__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
