Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
      <value-group caption="CDAC Output Buffer Enable bit" name="DAC3CON__DACOE">
         <value caption="Output is enabled; CDAC voltage is connected to the pin" name="" value="0x1" />
         <value caption="Output is disabled; drive to pin is floating" name="" value="0x0" />
      </value-group>
      <value-group caption="CDAC Enable bit" name="DAC3CON__ON">
         <value caption="The CDAC is enabled" name="" value="0x1" />
         <value caption="The CDAC is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02481" name="CFG" version="">
      <register-group name="CFG">
         <register caption="Configuration Control Register" name="CFGCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="CFGCON__TDOEN" />
            <bitfield caption="Trace Output Enable bit" mask="0x00000004" name="TROEN" values="CFGCON__TROEN" />
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="CFGCON__JTAGEN" />
            <bitfield caption="Flash ECC Configuration bits" mask="0x00000030" name="ECCCON" values="CFGCON__ECCCON" />
            <bitfield caption="I/O Analog Charge Pump Enable bit" mask="0x00000080" name="IOANCPEN" values="CFGCON__IOANCPEN" />
            <bitfield caption="Permission Group Lock bit" mask="0x00000800" name="PGLOCK" values="CFGCON__PGLOCK" />
            <bitfield caption="Peripheral Module Disable bit" mask="0x00001000" name="PMDLOCK" values="CFGCON__PMDLOCK" />
            <bitfield caption="Peripheral Pin Select Lock bit" mask="0x00002000" name="IOLOCK" values="CFGCON__IOLOCK" />
            <bitfield caption="Output Compare Alternate Clock Selection bit" mask="0x00010000" name="OCACLK" values="CFGCON__OCACLK" />
            <bitfield caption="Input Capture Alternate Clock Selection bit" mask="0x00020000" name="ICACLK" values="CFGCON__ICACLK" />
            <bitfield caption="PWM Alternate I/O Pin Selection bit" mask="0x00040000" name="PWMAPIN1" values="CFGCON__PWMAPIN1" />
            <bitfield caption="PWM Alternate I/O Pin Selection bit" mask="0x00080000" name="PWMAPIN2" values="CFGCON__PWMAPIN2" />
            <bitfield caption="PWM Alternate I/O Pin Selection bit" mask="0x00100000" name="PWMAPIN3" values="CFGCON__PWMAPIN3" />
            <bitfield caption="PWM Alternate I/O Pin Selection bit" mask="0x00200000" name="PWMAPIN4" values="CFGCON__PWMAPIN4" />
            <bitfield caption="PWM Alternate I/O Pin Selection bit" mask="0x00400000" name="PWMAPIN5" values="CFGCON__PWMAPIN5" />
            <bitfield caption="PWM Alternate I/O Pin Selection bit" mask="0x00800000" name="PWMAPIN6" values="CFGCON__PWMAPIN6" />
            <bitfield caption="ADC Arbitration Priority to SRAM bit" mask="0x04000000" name="ADCPRI" values="CFGCON__ADCPRI" />
         </register>
         <register caption="" name="DEVID" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0FFFFFFF" name="DEVID" />
            <bitfield mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
         <register caption="" name="PMD1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCMD" />
            <bitfield mask="0x00000010" name="DAC1MD" />
            <bitfield mask="0x00000020" name="DAC2MD" />
            <bitfield mask="0x00000040" name="DAC3MD" />
            <bitfield mask="0x00000100" name="CTMUMD" />
            <bitfield mask="0x00000200" name="EEMD" />
         </register>
         <register caption="" name="PMD2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1MD" />
            <bitfield mask="0x00000002" name="CMP2MD" />
            <bitfield mask="0x00000004" name="CMP3MD" />
            <bitfield mask="0x00000008" name="CMP4MD" />
            <bitfield mask="0x00000010" name="CMP5MD" />
            <bitfield mask="0x00010000" name="OPA1MD" />
            <bitfield mask="0x00020000" name="OPA2MD" />
            <bitfield mask="0x00040000" name="OPA3MD" />
            <bitfield mask="0x00100000" name="OPA5MD" />
         </register>
         <register caption="" name="PMD3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IC1MD" />
            <bitfield mask="0x00000002" name="IC2MD" />
            <bitfield mask="0x00000004" name="IC3MD" />
            <bitfield mask="0x00000008" name="IC4MD" />
            <bitfield mask="0x00000010" name="IC5MD" />
            <bitfield mask="0x00000020" name="IC6MD" />
            <bitfield mask="0x00000040" name="IC7MD" />
            <bitfield mask="0x00000080" name="IC8MD" />
            <bitfield mask="0x00000100" name="IC9MD" />
            <bitfield mask="0x00000200" name="IC10MD" />
            <bitfield mask="0x00000400" name="IC11MD" />
            <bitfield mask="0x00000800" name="IC12MD" />
            <bitfield mask="0x00001000" name="IC13MD" />
            <bitfield mask="0x00002000" name="IC14MD" />
            <bitfield mask="0x00004000" name="IC15MD" />
            <bitfield mask="0x00008000" name="IC16MD" />
            <bitfield mask="0x00010000" name="OC1MD" />
            <bitfield mask="0x00020000" name="OC2MD" />
            <bitfield mask="0x00040000" name="OC3MD" />
            <bitfield mask="0x00080000" name="OC4MD" />
            <bitfield mask="0x00100000" name="OC5MD" />
            <bitfield mask="0x00200000" name="OC6MD" />
            <bitfield mask="0x00400000" name="OC7MD" />
            <bitfield mask="0x00800000" name="OC8MD" />
            <bitfield mask="0x01000000" name="OC9MD" />
            <bitfield mask="0x02000000" name="OC10MD" />
            <bitfield mask="0x04000000" name="OC11MD" />
            <bitfield mask="0x08000000" name="OC12MD" />
            <bitfield mask="0x10000000" name="OC13MD" />
            <bitfield mask="0x20000000" name="OC14MD" />
            <bitfield mask="0x40000000" name="OC15MD" />
            <bitfield mask="0x80000000" name="OC16MD" />
         </register>
