Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
      <value-group caption="Flash Control Permission Group bits" name="CFGPG__FCPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Permission bits" name="CFGPG__ADCPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Permission Group bits" name="CFGPG__JTAGPG">
         <value caption="(If RDPER(3) is 1) read access / (If WRPER(3) is 1) write access" name="" value="0x3" />
         <value caption="(If RDPER(2) is 1) read access / (If WRPER(2) is 1) write access" name="" value="0x2" />
         <value caption="(If RDPER(1) is 1) read access / (If WRPER(1) is 1) write access" name="" value="0x1" />
         <value caption="(If RDPER(0) is 1) read access / (If WRPER(0) is 1) write access" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Unable to Lock Status Read-only bit" name="CFGAPP2__POSCFAIL">
         <value caption="Crystal or Resonator usage failed" name="" value="0x0" />
         <value caption="Crystal or resonator is locked or is indeterminate. If successfully locked, clock status is determined bythe SPLLRDY (CLKSTAT&lt;7&gt;) status flag." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01427" name="CMP" version="">
      <register-group name="CMP">
         <register caption="Op amp/Comparator Status Register" name="CMSTAT" offset="0x0" rw="RW" size="4">
            <bitfield caption="Op amp/Comparator 1 Output Status bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Op amp/Comparator 2 Output Status bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Op amp/Comparator 3 Output Status bit" mask="0x00000004" name="C3OUT" values="CMSTAT__C3OUT" />
            <bitfield caption="Op amp/Comparator 4 Output Status bit" mask="0x00000008" name="C4OUT" values="CMSTAT__C4OUT" />
            <bitfield caption="Op amp/Comparator 5 Output Status bit" mask="0x00000010" name="C5OUT" values="CMSTAT__C5OUT" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
            <bitfield caption="Comparator 1 Event Status bit" mask="0x00010000" name="C1EVT" values="CMSTAT__C1EVT" />
            <bitfield caption="Comparator 2 Event Status bit" mask="0x00020000" name="C2EVT" values="CMSTAT__C2EVT" />
            <bitfield caption="Comparator 3 Event Status bit" mask="0x00040000" name="C3EVT" values="CMSTAT__C3EVT" />
            <bitfield caption="Comparator 4 Event Status bit" mask="0x00080000" name="C4EVT" values="CMSTAT__C4EVT" />
            <bitfield caption="Comparator 5 Event Status bit" mask="0x00100000" name="C5EVT" values="CMSTAT__C5EVT" />
         </register>
         <register caption="Op amp/Comparator x Control Register" name="CM1CON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM1CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM1CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT" />
            <bitfield caption="Comparator Event bit" mask="0x00000200" name="CEVT" values="CM1CON__CEVT" />
            <bitfield caption="Opamp Low-Power Mode Select bit" mask="0x00001000" name="OPLPWR" values="CM1CON__OPLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM1CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM1CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM1CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM1CON__CFSEL" />
            <bitfield caption="Hysteresis Selection bits" mask="0x03000000" name="HYSSEL" values="CM1CON__HYSSEL" />
            <bitfield caption="Comparator Hysteresis Polarity Selection" mask="0x10000000" name="HYSPOL" values="CM1CON__HYSPOL" />
            <bitfield caption="Op amp Fixed Gain Enable bit" mask="0x40000000" name="ENPGA" values="CM1CON__ENPGA" />
            <bitfield caption="Op amp Enable bit" mask="0x80000000" name="OPAON" values="CM1CON__OPAON" />
         </register>
         <register caption="Op amp/Comparator x Control Register" name="CM2CON" offset="0x30" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM2CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM2CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT" />
            <bitfield caption="Comparator Event bit" mask="0x00000200" name="CEVT" values="CM2CON__CEVT" />
            <bitfield caption="Opamp Low-Power Mode Select bit" mask="0x00001000" name="OPLPWR" values="CM2CON__OPLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM2CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM2CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM2CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM2CON__CFSEL" />
            <bitfield caption="Hysteresis Selection bits" mask="0x03000000" name="HYSSEL" values="CM2CON__HYSSEL" />
            <bitfield caption="Comparator Hysteresis Polarity Selection" mask="0x10000000" name="HYSPOL" values="CM2CON__HYSPOL" />
            <bitfield caption="Op amp Fixed Gain Enable bit" mask="0x40000000" name="ENPGA" values="CM2CON__ENPGA" />
            <bitfield caption="Op amp Enable bit" mask="0x80000000" name="OPAON" values="CM2CON__OPAON" />
         </register>
