Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="Op amp/Comparator x Control Register" name="CM3CON" offset="0x50" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM3CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM3CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM3CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM3CON__COUT" />
            <bitfield caption="Comparator Event bit" mask="0x00000200" name="CEVT" values="CM3CON__CEVT" />
            <bitfield caption="Opamp Low-Power Mode Select bit" mask="0x00001000" name="OPLPWR" values="CM3CON__OPLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM3CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM3CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM3CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM3CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM3CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM3CON__CFSEL" />
            <bitfield caption="Hysteresis Selection bits" mask="0x03000000" name="HYSSEL" values="CM3CON__HYSSEL" />
            <bitfield caption="Comparator Hysteresis Polarity Selection" mask="0x10000000" name="HYSPOL" values="CM3CON__HYSPOL" />
            <bitfield caption="Op amp Fixed Gain Enable bit" mask="0x40000000" name="ENPGA" values="CM3CON__ENPGA" />
            <bitfield caption="Op amp Enable bit" mask="0x80000000" name="OPAON" values="CM3CON__OPAON" />
         </register>
         <register caption="Op amp/Comparator x Control Register" name="CM4CON" offset="0x70" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM4CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM4CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM4CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM4CON__COUT" />
            <bitfield caption="Comparator Event bit" mask="0x00000200" name="CEVT" values="CM4CON__CEVT" />
            <bitfield caption="Opamp Low-Power Mode Select bit" mask="0x00001000" name="OPLPWR" values="CM4CON__OPLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM4CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM4CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM4CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM4CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM4CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM4CON__CFSEL" />
            <bitfield caption="Hysteresis Selection bits" mask="0x03000000" name="HYSSEL" values="CM4CON__HYSSEL" />
            <bitfield caption="Comparator Hysteresis Polarity Selection" mask="0x10000000" name="HYSPOL" values="CM4CON__HYSPOL" />
            <bitfield caption="Op amp Fixed Gain Enable bit" mask="0x40000000" name="ENPGA" values="CM4CON__ENPGA" />
            <bitfield caption="Op amp Enable bit" mask="0x80000000" name="OPAON" values="CM4CON__OPAON" />
         </register>
         <register caption="Op amp/Comparator x Control Register" name="CM5CON" offset="0x90" rw="RW" size="4">
            <bitfield caption="Comparator Channel Select bits" mask="0x00000003" name="CCH" values="CM5CON__CCH" />
            <bitfield caption="Op amp/Comparator Reference Select bit" mask="0x00000010" name="CREF" values="CM5CON__CREF" />
            <bitfield caption="Trigger/Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM5CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM5CON__COUT" />
            <bitfield caption="Comparator Event bit" mask="0x00000200" name="CEVT" values="CM5CON__CEVT" />
            <bitfield caption="Opamp Low-Power Mode Select bit" mask="0x00001000" name="OPLPWR" values="CM5CON__OPLPWR" />
            <bitfield caption="Comparator Output Polarity Select bit" mask="0x00002000" name="CPOL" values="CM5CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM5CON__COE" />
            <bitfield caption="Comparator Enable bit" mask="0x00008000" name="ON" values="CM5CON__ON" />
            <bitfield caption="Comparator Output Filter Clock Divide Select bits" mask="0x00070000" name="CFDIV" values="CM5CON__CFDIV" />
            <bitfield caption="Comparator Output Digital Filter Enable bit" mask="0x00080000" name="CFLTREN" values="CM5CON__CFLTREN" />
            <bitfield caption="Comparator Output Filter Clock Source Select bits" mask="0x00700000" name="CFSEL" values="CM5CON__CFSEL" />
            <bitfield caption="Hysteresis Selection bits" mask="0x03000000" name="HYSSEL" values="CM5CON__HYSSEL" />
            <bitfield caption="Comparator Hysteresis Polarity Selection" mask="0x10000000" name="HYSPOL" values="CM5CON__HYSPOL" />
            <bitfield caption="Op amp Fixed Gain Enable bit" mask="0x40000000" name="ENPGA" values="CM5CON__ENPGA" />
            <bitfield caption="Op amp Enable bit" mask="0x80000000" name="OPAON" values="CM5CON__OPAON" />
         </register>
