Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
      <value-group caption="Comparator Output Filter Clock Divide Select bits" name="CM1CON__CFDIV">
         <value caption="1:128 Clock Divide" name="" value="0x7" />
         <value caption="1:64 Clock Divide" name="" value="0x6" />
         <value caption="1:32 Clock Divide" name="" value="0x5" />
         <value caption="1:16 Clock Divide" name="" value="0x4" />
         <value caption="1:8 Clock Divide" name="" value="0x3" />
         <value caption="1:4 Clock Divide" name="" value="0x2" />
         <value caption="1:2 Clock Divide" name="" value="0x1" />
         <value caption="1:1 Clock Divide" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Digital Filter Enable bit" name="CM1CON__CFLTREN">
         <value caption="Digital Filters enabled" name="" value="0x1" />
         <value caption="Digital Filters disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Source Select bits" name="CM1CON__CFSEL">
         <value caption="PBCLK2/Timer5 Period Value (PR5)" name="" value="0x7" />
         <value caption="PBCLK2/Timer4 Period Value (PR4)" name="" value="0x6" />
         <value caption="PBCLK2/Timer3 Period Value (PR3)" name="" value="0x5" />
         <value caption="PBCLK2/Timer2 Period Value (PR2)" name="" value="0x4" />
         <value caption="REFCLK3 Clock" name="" value="0x3" />
         <value caption="PWM Secondary Special Event" name="" value="0x2" />
         <value caption="PPBCLK2 Clock" name="" value="0x1" />
         <value caption="SYSCLK Clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Hysteresis Selection bits" name="CM1CON__HYSSEL">
         <value caption="Set highest hysteresis level (Typical 45 mV)" name="" value="0x3" />
         <value caption="Set medium hysteresis level (Typical 30 mV)" name="" value="0x2" />
         <value caption="Set lowest hysteresis level (Typical 15 mV)" name="" value="0x1" />
         <value caption="No hysteresis selected." name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Hysteresis Polarity Selection" name="CM1CON__HYSPOL">
         <value caption="Hysteresis on falling edge, rising edge is accurate" name="" value="0x1" />
         <value caption="Hysteresis on rising edge, falling edge is accurate" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Fixed Gain Enable bit" name="CM1CON__ENPGA">
         <value caption="Op amp is operating in Fixed Gain 1X mode" name="" value="0x1" />
         <value caption="Op amp is operating in Open Loop mode (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Enable bit" name="CM1CON__OPAON">
         <value caption="Op amp enabled and connected to pin" name="" value="0x1" />
         <value caption="Op amp disabled and pin is released to other functions" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Channel Select bits" name="CM2CON__CCH">
         <value caption="CxIN4-" name="" value="0x3" />
         <value caption="CxIN3-" name="" value="0x2" />
         <value caption="CxIN2-" name="" value="0x1" />
         <value caption="CxIN1-" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM2CON__CREF">
         <value caption="VIN+ input connects to internal CDAC3 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM2CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(When CPOL is 0) Trigger/Event generated only on high-to-low transition of the polarity-selected comparator output / (When CPOL is 1) Trigger/Event generated only on low-to-high transition of the polarity-selected comparator output" name="" value="0x2" />
         <value caption="(When CPOL is 0) Trigger/Event generated only on low-to-high transition of the polarity-selected comparator output / (When CPOL is 1) Trigger/Event generated only on high-to-low transition of the polarity-selected comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM2CON__COUT">
         <value caption="(When CPOL is 0) VIN+ &gt; VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH-" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Event bit" name="CM2CON__CEVT">
         <value caption="Comparator event according to EVPOL bit settings occurred" name="" value="0x1" />
         <value caption="Comparator event did not occur" name="" value="0x0" />
      </value-group>
      <value-group caption="Opamp Low-Power Mode Select bit" name="CM2CON__OPLPWR">
         <value caption="Comparator operates in Low-Power mode" name="" value="0x1" />
         <value caption="Comparator does not operate in Low-Power mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Polarity Select bit" name="CM2CON__CPOL">
         <value caption="Comparator output is inverted" name="" value="0x1" />
         <value caption="Comparator output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM2CON__COE">
         <value caption="Comparator output is present on the CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is internal only" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Enable bit" name="CM2CON__ON">
         <value caption="Comparator is enabled" name="" value="0x1" />
         <value caption="Comparator is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Divide Select bits" name="CM2CON__CFDIV">
         <value caption="1:128 Clock Divide" name="" value="0x7" />
         <value caption="1:64 Clock Divide" name="" value="0x6" />
         <value caption="1:32 Clock Divide" name="" value="0x5" />
         <value caption="1:16 Clock Divide" name="" value="0x4" />
         <value caption="1:8 Clock Divide" name="" value="0x3" />
         <value caption="1:4 Clock Divide" name="" value="0x2" />
         <value caption="1:2 Clock Divide" name="" value="0x1" />
         <value caption="1:1 Clock Divide" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Digital Filter Enable bit" name="CM2CON__CFLTREN">
         <value caption="Digital Filters enabled" name="" value="0x1" />
         <value caption="Digital Filters disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Filter Clock Source Select bits" name="CM2CON__CFSEL">
         <value caption="PBCLK2/Timer5 Period Value (PR5)" name="" value="0x7" />
         <value caption="PBCLK2/Timer4 Period Value (PR4)" name="" value="0x6" />
         <value caption="PBCLK2/Timer3 Period Value (PR3)" name="" value="0x5" />
         <value caption="PBCLK2/Timer2 Period Value (PR2)" name="" value="0x4" />
         <value caption="REFCLK3 Clock" name="" value="0x3" />
         <value caption="PWM Secondary Special Event" name="" value="0x2" />
         <value caption="PPBCLK2 Clock" name="" value="0x1" />
         <value caption="SYSCLK Clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Hysteresis Selection bits" name="CM2CON__HYSSEL">
         <value caption="Set highest hysteresis level (Typical 45 mV)" name="" value="0x3" />
         <value caption="Set medium hysteresis level (Typical 30 mV)" name="" value="0x2" />
         <value caption="Set lowest hysteresis level (Typical 15 mV)" name="" value="0x1" />
         <value caption="No hysteresis selected." name="" value="0x0" />
      </value-group>
