Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
      <value-group caption="Primary Oscillator Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="Posc is stable and ready" name="" value="0x1" />
         <value caption="Posc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="Sosc is stable and ready" name="" value="0x1" />
         <value caption="Sosc is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Power RC Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1" />
         <value caption="LPRC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Ready Status bit" name="CLKSTAT__SPLLRDY">
         <value caption="SPLL is ready" name="" value="0x1" />
         <value caption="SPLL is not ready" name="" value="0x0" />
      </value-group>
         <value-group caption="USB PLL (UPLL) Ready Status bit" name="CLKSTAT__UPLLRDY">
         <value caption="UPLL is ready" name="" value="0x1" />
         <value caption="UPLL is not ready" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02823" name="RCON" version="2">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON">
            <bitfield caption="Power-on Reset Flag bit" mask="0x1" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x2" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x4" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x8" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x10" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x20" name="DMTO" values="RCON__DMTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x40" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset (MCLR) Pin Flag bit" mask="0x80" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x200" name="CMR" values="RCON__CMR" />
            <bitfield caption="Deep Sleep Mode Flag bit" mask="0x400" name="DPSLP" values="RCON__DPSLP" />
            <bitfield caption="VBAT Mode Flag bit" mask="0x10000" name="VBAT" values="RCON__VBAT" />
            <bitfield caption="VBPOR Mode Flag bit" mask="0x20000" name="VBPOR" values="RCON__VBPOR" />
            <bitfield caption="Primary/Secondary Configuration Registers Error Flag bit" mask="0x4000000" name="BCFGFAIL" values="RCON__BCFGFAIL" />
            <bitfield caption="Primary Configuration Registers Error Flag bit" mask="0x8000000" name="BCFGERR" values="RCON__BCFGERR" />
            <bitfield caption="Core Voltage POR Flag bit" mask="0x40000000" name="PORCORE" values="RCON__PORCORE" />
            <bitfield caption="I/O Voltage POR Flag bit" mask="0x80000000" name="PORIO" values="RCON__PORIO" />
         </register>
         <register caption="Software Reset Register" name="RSWRST">
            <bitfield caption="Enable software Reset event" mask="0x1" name="SWRST" values="RSWRST__SWRST" />
         </register>
         <register caption="Non-maskable Interrupt Control Register" name="RNMICON">
            <bitfield caption="NMI Reset Counter Value bits" mask="0xffff" name="NMICNT" values="RNMICON__NMICNT" />
            <bitfield caption="Watchdog Timer Time-out in Sleep Mode Flag bit" mask="0x10000" name="WDTS" values="RNMICON__WDTS" />
            <bitfield caption="Clock Fail Detect bit" mask="0x20000" name="CF" values="RNMICON__CF" />
            <bitfield caption="General NMI bit" mask="0x80000" name="GNMI" values="RNMICON__GNMI" />
            <bitfield caption="Software NMI Trigger" mask="0x800000" name="SWNMI" values="RNMICON__SWNMI" />
            <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x1000000" name="WDTO" values="RNMICON__WDTO" />
            <bitfield caption="Deadman Timer Time-out Flag bit" mask="0x2000000" name="DMTO" values="RNMICON__DMTO" />
         </register>
         <register caption="Power Control Register" name="PWRCON">
            <bitfield caption="Internal Voltage Regulator Stand-by Enable bit" mask="0x1" name="VREGS" values="PWRCON__VREGS" />
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="RESET" value="0x1" />
         <value caption="Power-on Reset has NOT occurred" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="RESET" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="NORESET" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="IDLE" value="0x1" />
         <value caption="Device was not in Idle mode" name="NOIDLE" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="SLEEP" value="0x1" />
         <value caption="Device was not in Sleep mode" name="NOSLEEP" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="TIMEOUT" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="NOTIMEOUT" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="TIMEOUT" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="NOTIMEOUT" value="0x0" />
      </value-group>
