Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="I2C Status Register" name="I2C3STAT" offset="0x20410" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C3STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C3STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C3STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C3STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C3STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C3STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C3STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C3STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C3STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C3STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C3STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C3STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C3STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C3STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C4STAT" offset="0x20610" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C4STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C4STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C4STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C4STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C4STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C4STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C4STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C4STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C4STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C4STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C4STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C4STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C4STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C4STAT__ACKSTAT" />
         </register>
         <register caption="" name="I2C1ADD" offset="0x020" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C2ADD" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C3ADD" offset="0x20420" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C4ADD" offset="0x20620" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CADD" />
         </register>
         <register caption="" name="I2C1MSK" offset="0x030" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C2MSK" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C3MSK" offset="0x20430" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C4MSK" offset="0x20630" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="I2CMSK" />
         </register>
         <register caption="" name="I2C1BRG" offset="0x040" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C2BRG" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C3BRG" offset="0x20440" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C4BRG" offset="0x20640" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="I2CBRG" />
         </register>
         <register caption="" name="I2C1TRN" offset="0x050" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C2TRN" offset="0x250" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C3TRN" offset="0x20450" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C4TRN" offset="0x20650" rw="W" size="4">
            <bitfield mask="0x000000FF" name="I2CTRN" />
         </register>
         <register caption="" name="I2C1RCV" offset="0x060" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
         <register caption="" name="I2C2RCV" offset="0x260" rw="R" size="4">
            <bitfield mask="0x000000FF" name="I2CRCV" />
         </register>
