Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="Interrupt enable control register" name="IEC6" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="QEI6IE" />
            <bitfield mask="0x00000004" name="I2C4BIE" />
            <bitfield mask="0x00000008" name="I2C4SIE" />
            <bitfield mask="0x00000010" name="I2C4MIE" />
            <bitfield mask="0x00000020" name="IC10EIE" />
            <bitfield mask="0x00000040" name="IC10IE" />
            <bitfield mask="0x00000080" name="OC10IE" />
            <bitfield mask="0x00000100" name="IC11EIE" />
            <bitfield mask="0x00000200" name="IC11IE" />
            <bitfield mask="0x00000400" name="OC11IE" />
            <bitfield mask="0x00000800" name="IC12EIE" />
            <bitfield mask="0x00001000" name="IC12IE" />
            <bitfield mask="0x00002000" name="OC12IE" />
            <bitfield mask="0x00004000" name="IC13EIE" />
            <bitfield mask="0x00008000" name="IC13IE" />
            <bitfield mask="0x00010000" name="OC13IE" />
            <bitfield mask="0x00020000" name="IC14EIE" />
            <bitfield mask="0x00040000" name="IC14IE" />
            <bitfield mask="0x00080000" name="OC14IE" />
            <bitfield mask="0x00100000" name="IC15EIE" />
            <bitfield mask="0x00200000" name="IC15IE" />
            <bitfield mask="0x00400000" name="OC15IE" />
            <bitfield mask="0x00800000" name="IC16EIE" />
            <bitfield mask="0x01000000" name="IC16IE" />
            <bitfield mask="0x02000000" name="OC16IE" />
            <bitfield mask="0x04000000" name="SPI3EIE" />
            <bitfield mask="0x08000000" name="SPI3RXIE" />
            <bitfield mask="0x10000000" name="SPI3TXIE" />
            <bitfield mask="0x20000000" name="SPI4EIE" />
            <bitfield mask="0x40000000" name="SPI4RXIE" />
            <bitfield mask="0x80000000" name="SPI4TXIE" />
         </register>
         <register caption="Interrupt enable control register" name="IEC7" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SPI5EIE" />
            <bitfield mask="0x00000002" name="SPI5RXIE" />
            <bitfield mask="0x00000004" name="SPI5TXIE" />
            <bitfield mask="0x00000008" name="SPI6EIE" />
            <bitfield mask="0x00000010" name="SPI6RXIE" />
            <bitfield mask="0x00000020" name="SPI6TXIE" />
            <bitfield mask="0x00000040" name="SBIE" />
            <bitfield mask="0x00004000" name="PWM7IE" />
            <bitfield mask="0x00008000" name="PWM8IE" />
            <bitfield mask="0x00010000" name="PWM9IE" />
            <bitfield mask="0x00020000" name="PWM10IE" />
            <bitfield mask="0x00040000" name="PWM11IE" />
            <bitfield mask="0x00080000" name="PWM12IE" />
            <bitfield mask="0x00100000" name="USB2IE" />
            <bitfield mask="0x00200000" name="AD1DC3IE" />
            <bitfield mask="0x00400000" name="AD1DC4IE" />
            <bitfield mask="0x00800000" name="PCACHEIE" />
            <bitfield mask="0x40000000" name="CPCIE" />
            <bitfield mask="0x80000000" name="CFDCIE" />
         </register>
         <register caption="Interrupt priority control register" name="IPC0" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS" />
            <bitfield mask="0x0000001C" name="CTIP" />
            <bitfield mask="0x00000300" name="CS0IS" />
            <bitfield mask="0x00001C00" name="CS0IP" />
            <bitfield mask="0x00030000" name="CS1IS" />
            <bitfield mask="0x001C0000" name="CS1IP" />
            <bitfield mask="0x03000000" name="INT0IS" />
            <bitfield mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC1" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS" />
            <bitfield mask="0x0000001C" name="T1IP" />
            <bitfield mask="0x00000300" name="IC1EIS" />
            <bitfield mask="0x00001C00" name="IC1EIP" />
            <bitfield mask="0x00030000" name="IC1IS" />
            <bitfield mask="0x001C0000" name="IC1IP" />
            <bitfield mask="0x03000000" name="OC1IS" />
            <bitfield mask="0x1C000000" name="OC1IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC2" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000003" name="INT1IS" />
            <bitfield mask="0x0000001C" name="INT1IP" />
            <bitfield mask="0x00000300" name="T2IS" />
            <bitfield mask="0x00001C00" name="T2IP" />
            <bitfield mask="0x00030000" name="IC2EIS" />
            <bitfield mask="0x001C0000" name="IC2EIP" />
            <bitfield mask="0x03000000" name="IC2IS" />
            <bitfield mask="0x1C000000" name="IC2IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC3" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00000003" name="OC2IS" />
            <bitfield mask="0x0000001C" name="OC2IP" />
            <bitfield mask="0x00000300" name="INT2IS" />
            <bitfield mask="0x00001C00" name="INT2IP" />
            <bitfield mask="0x00030000" name="T3IS" />
            <bitfield mask="0x001C0000" name="T3IP" />
            <bitfield mask="0x03000000" name="IC3EIS" />
            <bitfield mask="0x1C000000" name="IC3EIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC4" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC3IS" />
            <bitfield mask="0x0000001C" name="IC3IP" />
            <bitfield mask="0x00000300" name="OC3IS" />
            <bitfield mask="0x00001C00" name="OC3IP" />
            <bitfield mask="0x00030000" name="INT3IS" />
            <bitfield mask="0x001C0000" name="INT3IP" />
            <bitfield mask="0x03000000" name="T4IS" />
            <bitfield mask="0x1C000000" name="T4IP" />
         </register>
