Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="Interrupt priority control register" name="IPC5" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC4EIS" />
            <bitfield mask="0x0000001C" name="IC4EIP" />
            <bitfield mask="0x00000300" name="IC4IS" />
            <bitfield mask="0x00001C00" name="IC4IP" />
            <bitfield mask="0x00030000" name="OC4IS" />
            <bitfield mask="0x001C0000" name="OC4IP" />
            <bitfield mask="0x03000000" name="INT4IS" />
            <bitfield mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC6" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T5IS" />
            <bitfield mask="0x0000001C" name="T5IP" />
            <bitfield mask="0x00000300" name="IC5EIS" />
            <bitfield mask="0x00001C00" name="IC5EIP" />
            <bitfield mask="0x00030000" name="IC5IS" />
            <bitfield mask="0x001C0000" name="IC5IP" />
            <bitfield mask="0x03000000" name="OC5IS" />
            <bitfield mask="0x1C000000" name="OC5IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC7" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00030000" name="RTCCIS" />
            <bitfield mask="0x001C0000" name="RTCCIP" />
            <bitfield mask="0x03000000" name="FCEIS" />
            <bitfield mask="0x1C000000" name="FCEIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC8" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP1IS" />
            <bitfield mask="0x0000001C" name="CMP1IP" />
            <bitfield mask="0x00000300" name="CMP2IS" />
            <bitfield mask="0x00001C00" name="CMP2IP" />
            <bitfield mask="0x00030000" name="USB1IS" />
            <bitfield mask="0x001C0000" name="USB1IP" />
            <bitfield mask="0x03000000" name="SPI1EIS" />
            <bitfield mask="0x1C000000" name="SPI1EIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC9" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI1RXIS" />
            <bitfield mask="0x0000001C" name="SPI1RXIP" />
            <bitfield mask="0x00000300" name="SPI1TXIS" />
            <bitfield mask="0x00001C00" name="SPI1TXIP" />
            <bitfield mask="0x00030000" name="U1EIS" />
            <bitfield mask="0x001C0000" name="U1EIP" />
            <bitfield mask="0x03000000" name="U1RXIS" />
            <bitfield mask="0x1C000000" name="U1RXIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC10" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1TXIS" />
            <bitfield mask="0x0000001C" name="U1TXIP" />
            <bitfield mask="0x00000300" name="I2C1BIS" />
            <bitfield mask="0x00001C00" name="I2C1BIP" />
            <bitfield mask="0x00030000" name="I2C1SIS" />
            <bitfield mask="0x001C0000" name="I2C1SIP" />
            <bitfield mask="0x03000000" name="I2C1MIS" />
            <bitfield mask="0x1C000000" name="I2C1MIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC11" offset="0x1f0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNAIS" />
            <bitfield mask="0x0000001C" name="CNAIP" />
            <bitfield mask="0x00000300" name="CNBIS" />
            <bitfield mask="0x00001C00" name="CNBIP" />
            <bitfield mask="0x00030000" name="CNCIS" />
            <bitfield mask="0x001C0000" name="CNCIP" />
            <bitfield mask="0x03000000" name="CNDIS" />
            <bitfield mask="0x1C000000" name="CNDIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC12" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNEIS" />
            <bitfield mask="0x0000001C" name="CNEIP" />
            <bitfield mask="0x00000300" name="CNFIS" />
            <bitfield mask="0x00001C00" name="CNFIP" />
            <bitfield mask="0x00030000" name="CNGIS" />
            <bitfield mask="0x001C0000" name="CNGIP" />
            <bitfield mask="0x03000000" name="PMPIS" />
            <bitfield mask="0x1C000000" name="PMPIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC13" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PMPEIS" />
            <bitfield mask="0x0000001C" name="PMPEIP" />
            <bitfield mask="0x00000300" name="SPI2EIS" />
            <bitfield mask="0x00001C00" name="SPI2EIP" />
            <bitfield mask="0x00030000" name="SPI2RXIS" />
            <bitfield mask="0x001C0000" name="SPI2RXIP" />
            <bitfield mask="0x03000000" name="SPI2TXIS" />
            <bitfield mask="0x1C000000" name="SPI2TXIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC14" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U2EIS" />
            <bitfield mask="0x0000001C" name="U2EIP" />
            <bitfield mask="0x00000300" name="U2RXIS" />
            <bitfield mask="0x00001C00" name="U2RXIP" />
            <bitfield mask="0x00030000" name="U2TXIS" />
            <bitfield mask="0x001C0000" name="U2TXIP" />
            <bitfield mask="0x03000000" name="I2C2BIS" />
            <bitfield mask="0x1C000000" name="I2C2BIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC15" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C2SIS" />
            <bitfield mask="0x0000001C" name="I2C2SIP" />
            <bitfield mask="0x00000300" name="I2C2MIS" />
            <bitfield mask="0x00001C00" name="I2C2MIP" />
            <bitfield mask="0x00030000" name="U3EIS" />
            <bitfield mask="0x001C0000" name="U3EIP" />
            <bitfield mask="0x03000000" name="U3RXIS" />
            <bitfield mask="0x1C000000" name="U3RXIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC16" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U3TXIS" />
            <bitfield mask="0x0000001C" name="U3TXIP" />
            <bitfield mask="0x00000300" name="U4EIS" />
            <bitfield mask="0x00001C00" name="U4EIP" />
            <bitfield mask="0x00030000" name="U4RXIS" />
            <bitfield mask="0x001C0000" name="U4RXIP" />
            <bitfield mask="0x03000000" name="U4TXIS" />
            <bitfield mask="0x1C000000" name="U4TXIP" />
         </register>
