Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="Interrupt priority control register" name="IPC45" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C3SIS" />
            <bitfield mask="0x0000001C" name="I2C3SIP" />
            <bitfield mask="0x00000300" name="I2C3MIS" />
            <bitfield mask="0x00001C00" name="I2C3MIP" />
            <bitfield mask="0x00030000" name="DMA4IS" />
            <bitfield mask="0x001C0000" name="DMA4IP" />
            <bitfield mask="0x03000000" name="DMA5IS" />
            <bitfield mask="0x1C000000" name="DMA5IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC46" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA6IS" />
            <bitfield mask="0x0000001C" name="DMA6IP" />
            <bitfield mask="0x00000300" name="DMA7IS" />
            <bitfield mask="0x00001C00" name="DMA7IP" />
            <bitfield mask="0x00030000" name="DATAEEIS" />
            <bitfield mask="0x001C0000" name="DATAEEIP" />
            <bitfield mask="0x03000000" name="CAN3IS" />
            <bitfield mask="0x1C000000" name="CAN3IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC47" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CAN4IS" />
            <bitfield mask="0x0000001C" name="CAN4IP" />
            <bitfield mask="0x00000300" name="QEI3IS" />
            <bitfield mask="0x00001C00" name="QEI3IP" />
            <bitfield mask="0x00030000" name="QEI4IS" />
            <bitfield mask="0x001C0000" name="QEI4IP" />
            <bitfield mask="0x03000000" name="QEI5IS" />
            <bitfield mask="0x1C000000" name="QEI5IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC48" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000003" name="QEI6IS" />
            <bitfield mask="0x0000001C" name="QEI6IP" />
            <bitfield mask="0x00030000" name="I2C4BIS" />
            <bitfield mask="0x001C0000" name="I2C4BIP" />
            <bitfield mask="0x03000000" name="I2C4SIS" />
            <bitfield mask="0x1C000000" name="I2C4SIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC49" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C4MIS" />
            <bitfield mask="0x0000001C" name="I2C4MIP" />
            <bitfield mask="0x00000300" name="IC10EIS" />
            <bitfield mask="0x00001C00" name="IC10EIP" />
            <bitfield mask="0x00030000" name="IC10IS" />
            <bitfield mask="0x001C0000" name="IC10IP" />
            <bitfield mask="0x03000000" name="OC10IS" />
            <bitfield mask="0x1C000000" name="OC10IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC50" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC11EIS" />
            <bitfield mask="0x0000001C" name="IC11EIP" />
            <bitfield mask="0x00000300" name="IC11IS" />
            <bitfield mask="0x00001C00" name="IC11IP" />
            <bitfield mask="0x00030000" name="OC11IS" />
            <bitfield mask="0x001C0000" name="OC11IP" />
            <bitfield mask="0x03000000" name="IC12EIS" />
            <bitfield mask="0x1C000000" name="IC12EIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC51" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC12IS" />
            <bitfield mask="0x0000001C" name="IC12IP" />
            <bitfield mask="0x00000300" name="OC12IS" />
            <bitfield mask="0x00001C00" name="OC12IP" />
            <bitfield mask="0x00030000" name="IC13EIS" />
            <bitfield mask="0x001C0000" name="IC13EIP" />
            <bitfield mask="0x03000000" name="IC13IS" />
            <bitfield mask="0x1C000000" name="IC13IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC52" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000003" name="OC13IS" />
            <bitfield mask="0x0000001C" name="OC13IP" />
            <bitfield mask="0x00000300" name="IC14EIS" />
            <bitfield mask="0x00001C00" name="IC14EIP" />
            <bitfield mask="0x00030000" name="IC14IS" />
            <bitfield mask="0x001C0000" name="IC14IP" />
            <bitfield mask="0x03000000" name="OC14IS" />
            <bitfield mask="0x1C000000" name="OC14IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC53" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC15EIS" />
            <bitfield mask="0x0000001C" name="IC15EIP" />
            <bitfield mask="0x00000300" name="IC15IS" />
            <bitfield mask="0x00001C00" name="IC15IP" />
            <bitfield mask="0x00030000" name="OC15IS" />
            <bitfield mask="0x001C0000" name="OC15IP" />
            <bitfield mask="0x03000000" name="IC16EIS" />
            <bitfield mask="0x1C000000" name="IC16EIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC54" offset="0x4a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC16IS" />
            <bitfield mask="0x0000001C" name="IC16IP" />
            <bitfield mask="0x00000300" name="OC16IS" />
            <bitfield mask="0x00001C00" name="OC16IP" />
            <bitfield mask="0x00030000" name="SPI3EIS" />
            <bitfield mask="0x001C0000" name="SPI3EIP" />
            <bitfield mask="0x03000000" name="SPI3RXIS" />
            <bitfield mask="0x1C000000" name="SPI3RXIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC55" offset="0x4b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI3TXIS" />
            <bitfield mask="0x0000001C" name="SPI3TXIP" />
            <bitfield mask="0x00000300" name="SPI4EIS" />
            <bitfield mask="0x00001C00" name="SPI4EIP" />
            <bitfield mask="0x00030000" name="SPI4RXIS" />
            <bitfield mask="0x001C0000" name="SPI4RXIP" />
            <bitfield mask="0x03000000" name="SPI4TXIS" />
            <bitfield mask="0x1C000000" name="SPI4TXIP" />
         </register>
