Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="Interrupt priority control register" name="IPC56" offset="0x4c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI5EIS" />
            <bitfield mask="0x0000001C" name="SPI5EIP" />
            <bitfield mask="0x00000300" name="SPI5RXIS" />
            <bitfield mask="0x00001C00" name="SPI5RXIP" />
            <bitfield mask="0x00030000" name="SPI5TXIS" />
            <bitfield mask="0x001C0000" name="SPI5TXIP" />
            <bitfield mask="0x03000000" name="SPI6EIS" />
            <bitfield mask="0x1C000000" name="SPI6EIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC57" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI6RXIS" />
            <bitfield mask="0x0000001C" name="SPI6RXIP" />
            <bitfield mask="0x00000300" name="SPI6TXIS" />
            <bitfield mask="0x00001C00" name="SPI6TXIP" />
            <bitfield mask="0x00030000" name="SBIS" />
            <bitfield mask="0x001C0000" name="SBIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC58" offset="0x4e0" rw="R" size="4" />
         <register caption="Interrupt priority control register" name="IPC59" offset="0x4f0" rw="RW" size="4">
            <bitfield mask="0x00030000" name="PWM7IS" />
            <bitfield mask="0x001C0000" name="PWM7IP" />
            <bitfield mask="0x03000000" name="PWM8IS" />
            <bitfield mask="0x1C000000" name="PWM8IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC60" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PWM9IS" />
            <bitfield mask="0x0000001C" name="PWM9IP" />
            <bitfield mask="0x00000300" name="PWM10IS" />
            <bitfield mask="0x00001C00" name="PWM10IP" />
            <bitfield mask="0x00030000" name="PWM11IS" />
            <bitfield mask="0x001C0000" name="PWM11IP" />
            <bitfield mask="0x03000000" name="PWM12IS" />
            <bitfield mask="0x1C000000" name="PWM12IP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC61" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000003" name="USB2IS" />
            <bitfield mask="0x0000001C" name="USB2IP" />
            <bitfield mask="0x00000300" name="AD1DC3IS" />
            <bitfield mask="0x00001C00" name="AD1DC3IP" />
            <bitfield mask="0x00030000" name="AD1DC4IS" />
            <bitfield mask="0x001C0000" name="AD1DC4IP" />
            <bitfield mask="0x03000000" name="PCACHEIS" />
            <bitfield mask="0x1C000000" name="PCACHEIP" />
         </register>
         <register caption="Interrupt priority control register" name="IPC62" offset="0x520" rw="R" size="4" />
         <register caption="Interrupt priority control register" name="IPC63" offset="0x530" rw="RW" size="4">
            <bitfield mask="0x00030000" name="CPCIS" />
            <bitfield mask="0x001C0000" name="CPCIP" />
            <bitfield mask="0x03000000" name="CFDCIS" />
            <bitfield mask="0x1C000000" name="CFDCIP" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF002" offset="0x548" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF003" offset="0x54c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF004" offset="0x550" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF005" offset="0x554" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF006" offset="0x558" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF007" offset="0x55c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF008" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF009" offset="0x564" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF010" offset="0x568" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF011" offset="0x56c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF012" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF013" offset="0x574" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt vector address offset register" name="OFF014" offset="0x578" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
