Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
      <value-group caption="Parallel Port Mode Select bits" name="PMMODE__MODE">
         <value caption="Master mode 1" name="" value="0x3" />
         <value caption="Master mode 2" name="" value="0x2" />
         <value caption="Enhanced Slave mode, control signals" name="" value="0x1" />
         <value caption="Legacy Parallel Slave Port, control signals" name="" value="0x0" />
      </value-group>
      <value-group caption="8/16-bit Mode bit" name="PMMODE__MODE16">
         <value caption="16-bit mode: a read or write to the data register invokes a single 16-bit transfer" name="" value="0x1" />
         <value caption="8-bit mode: a read or write to the data register invokes a single 8-bit transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Increment Mode bits" name="PMMODE__INCM">
         <value caption="Slave mode read and write buffers auto-increment (MODE = 00 only)" name="" value="0x3" />
         <value caption="Decrement ADDR and ADDR(15:0) by 1 every read/write cycle" name="" value="0x2" />
         <value caption="Increment ADDR and ADDR(15:0) by 1 every read/write cycle" name="" value="0x1" />
         <value caption="No increment or decrement of address" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Request Mode bits" name="PMMODE__IRQM">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated when Read Buffer 3 is read or Write Buffer 3 is written (Buffered PSP mode)or on a read or write operation when PMA = 11 (Addressable Slave mode only)" name="" value="0x2" />
         <value caption="Interrupt is generated at the end of the read/write cycle" name="" value="0x1" />
         <value caption="No Interrupt is generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Busy bit" name="PMMODE__BUSY">
         <value caption="Port is busy" name="" value="0x1" />
         <value caption="Port is not busy" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMADDR__CS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMADDR__CS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="PMALH/PMALL Strobe Enable bits" name="PMAEN__PTEN">
         <value caption="PMA15 and PMA14 function as either PMA or PMCS1 and PMCS2" name="" value="0x4000" />
         <value caption="PMA15 and PMA14 function as port I/O" name="" value="0x0" />
         <value caption="PMA function as PMP address lines" name="" value="0x4" />
         <value caption="PMA function as port I/O" name="" value="0x0" />
         <value caption="PMA1 and PMA0 function as either PMA or PMALH and PMALL" name="" value="0x1" />
         <value caption="PMA1 and PMA0 pads function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 0 Status Empty bit" name="PMSTAT__OB0E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 1 Status Empty bit" name="PMSTAT__OB1E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 2 Status Empty bit" name="PMSTAT__OB2E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer 3 Status Empty bit" name="PMSTAT__OB3E">
         <value caption="Output buffer is empty (writing data to the buffer will clear this bit)" name="" value="0x1" />
         <value caption="Output buffer contains data that has not been transmitted" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Underflow Status bit" name="PMSTAT__OBUF">
         <value caption="A read occurred from an empty output byte buffer (must be cleared in software)" name="" value="0x1" />
         <value caption="No underflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Empty Status bit" name="PMSTAT__OBE">
         <value caption="All readable output buffer registers are empty" name="" value="0x1" />
         <value caption="Some or all of the readable output buffer registers are full" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 0 Status Full bit" name="PMSTAT__IB0F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 1 Status Full bit" name="PMSTAT__IB1F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 2 Status Full bit" name="PMSTAT__IB2F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer 3 Status Full bit" name="PMSTAT__IB3F">
         <value caption="Input Buffer contains data that has not been read (reading buffer will clear this bit)" name="" value="0x1" />
         <value caption="Input Buffer does not contain any unread data" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Overflow Status bit" name="PMSTAT__IBOV">
         <value caption="A write attempt to a full input byte buffer is occurred (must be cleared in software)" name="" value="0x1" />
         <value caption="No overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Full Status bit" name="PMSTAT__IBF">
         <value caption="All writable input buffer registers are full" name="" value="0x1" />
         <value caption="Some or all of the writable input buffer registers are empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMWADDR__WCS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMWADDR__WCS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMRADDR__RCS1">
         <value caption="Chip Select 1 is active" name="" value="0x4000" />
         <value caption="Chip Select 1 is inactive (RADDR14 function is selected)" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMRADDR__RCS2">
         <value caption="Chip Select 2 is active" name="" value="0x8000" />
         <value caption="Chip Select 2 is inactive (RADDR15 function is selected)" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
