Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0512GPK064.atdf
         <register caption="UARTx Status and Control Register" name="U5STA" offset="0x8810" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U5STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U5STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U5STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U5STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U5STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U5STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U5STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U5STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U5STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U5STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U5STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U5STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U5STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U5STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U5STA__MASK" />
         </register>
         <register caption="UARTx Status and Control Register" name="U6STA" offset="0x8A10" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U6STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U6STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U6STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U6STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U6STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U6STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U6STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U6STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U6STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U6STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U6STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U6STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U6STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U6STA__UTXISEL" />
            <bitfield mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U6STA__MASK" />
         </register>
         <register caption="" name="U1TXREG" offset="0x8020" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U1TXREG" />
         </register>
         <register caption="" name="U2TXREG" offset="0x8220" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U2TXREG" />
         </register>
         <register caption="" name="U3TXREG" offset="0x8420" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U3TXREG" />
         </register>
         <register caption="" name="U4TXREG" offset="0x8620" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U4TXREG" />
         </register>
         <register caption="" name="U5TXREG" offset="0x8820" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U5TXREG" />
         </register>
         <register caption="" name="U6TXREG" offset="0x8A20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U6TXREG" />
         </register>
         <register caption="" name="U1RXREG" offset="0x8030" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U1RXREG" />
         </register>
         <register caption="" name="U2RXREG" offset="0x8230" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U2RXREG" />
         </register>
         <register caption="" name="U3RXREG" offset="0x8430" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U3RXREG" />
         </register>
         <register caption="" name="U4RXREG" offset="0x8630" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U4RXREG" />
         </register>
         <register caption="" name="U5RXREG" offset="0x8830" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U5RXREG" />
         </register>
         <register caption="" name="U6RXREG" offset="0x8A30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U6RXREG" />
         </register>
         <register caption="" name="U1BRG" offset="0x8040" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U2BRG" offset="0x8240" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U3BRG" offset="0x8440" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
         <register caption="" name="U4BRG" offset="0x8640" rw="RW" size="4">
            <bitfield mask="0x000FFFFF" name="BRG" />
         </register>
